<?php
// ----------------------------
// Task1
// ----------------------------

$name = "Kensho";

if($name === "Kensho") :
    echo "私は{$name}です"."\n";
    else:
        echo "あなたの名前ではありません"."\n";
    endif;

// ----------------------------
// Task2
// ----------------------------
$n = 0;
for($i = 1;$i <= 10000;$i++){
    $n += $i;
}
echo $n."\n";
// ----------------------------
// Task3
// ----------------------------
$fruits = array("りんご","オレンジ","キウイ","グレープフルーツ","レモン");

foreach($fruits as $fruit){
    echo $fruit."\n";
}
// ----------------------------
// Task4
// ----------------------------
// /* for文の始めの値を定義する /
// $start = 1;
// /* for文の終わりの値を定義する */
// $end = 100;

// for($i = $start; $i < $end; $i++){

//   // 5で割り切れたら{}内を実行する
//   if($i % 5 == 0){
//     echo $i
//   }
// }

// ----------------------------
// 修正後
// ----------------------------
/* for文の始めの値を定義する */
$start = 1;
/* for文の終わりの値を定義する */
$end = 100;

for($i = $start; $i <= $end; $i++){

  // 5で割り切れたら{}内を実行する
  if($i % 5 == 0){
    echo $i."\n";
  }
}
?>